In [44]:
# all imports go in this block
import sqlite3
import pandas as pd
from datetime import datetime
# import sys
# print(sys.version_info)

## Acquire data

Our data comes from a database file in SQLite format. We import it into a Pandas DataFrame for preprocessing.

In [2]:
# open connection 
conn = sqlite3.connect("data/database.sqlite")
cur = conn.cursor()

In [3]:
# function to execute queries
def executeQuery(cur, query):
    print("executing query: ")
    cur.execute(query)
    return cur.fetchall()

In [4]:
# list of all tables
q_all_tables = """SELECT name FROM sqlite_master
    WHERE type='table';"""
all_tables = executeQuery(cur, q_all_tables)
# print(all_tables)

executing query:

In [5]:
# read the Match table into Pandas DataFrame
q_matches = "SELECT * FROM MATCH;"
df_matches = pd.read_sql_query(q_matches, conn)
# do this only 1
# drop betting
df_matches = df_matches.drop(df_matches.iloc[:, 85:], axis=1)

#drop statistics
df_matches = df_matches.drop(df_matches.iloc[:, 77:], axis=1)

# drop X, Y positions
df_matches = df_matches.drop(df_matches.iloc[:, 11:55], axis=1)
# df_matches.head()
# drop X, Y positions
df_matches = df_matches.drop(df_matches.columns[[1, 2, 4]], axis=1)

In [6]:
# drop the X and Y positions of Players since they are not important

# pd.set_option('display.max_columns', None)

df_matches.head()
# print(df_matches.shape)

,id,season,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal,home_player_1,home_player_2,...,away_player_2,away_player_3,away_player_4,away_player_5,away_player_6,away_player_7,away_player_8,away_player_9,away_player_10,away_player_11
0,1,2008/2009,2008-08-17 00:00:00,492473,9987,9993,1,1,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,2008/2009,2008-08-16 00:00:00,492474,10000,9994,0,0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,2008/2009,2008-08-16 00:00:00,492475,9984,8635,0,3,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,2008/2009,2008-08-17 00:00:00,492476,9991,9998,5,0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,2008/2009,2008-08-16 00:00:00,492477,7947,9985,1,3,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
# player ids of last 10
# df_player_ids_last10 = df_matches.iloc[-10:, 8:]
# print(df_player_ids_last10)

# all_uniques_hp2 = list(df_matches.home_player_2.unique())
# print(len(all_uniques_hp2))

2415

In [23]:
# read the Match table into Pandas DataFrame
q_player = "SELECT * FROM PLAYER;"
df_player = pd.read_sql_query(q_player, conn)

# df_player.tail()
# drop Fifa Api ID - player_api_id identifies players across tables


# player_ids_unique = list(df_player["player_api_id"].unique())

# common_player_2 = list(set(all_uniques_hp2) & set(player_ids_unique))
# print(len(common_player_2))

#

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight
11055,11071,26357,Zoumana Camara,2488,1979-04-03 00:00:00,182.88,168
11056,11072,111182,Zsolt Laczko,164680,1986-12-18 00:00:00,182.88,176
11057,11073,36491,Zsolt Low,111191,1979-04-29 00:00:00,180.34,154
11058,11074,35506,Zurab Khizanishvili,47058,1981-10-06 00:00:00,185.42,172
11059,11075,39902,Zvjezdan Misimovic,102359,1982-06-05 00:00:00,180.34,176

In [25]:
# Drop player_fifa_api_id from player table
df_player = df_player.drop('player_fifa_api_id', axis=1)
df_player.tail()

,id,player_api_id,player_name,birthday,height,weight
11055,11071,26357,Zoumana Camara,1979-04-03 00:00:00,182.88,168
11056,11072,111182,Zsolt Laczko,1986-12-18 00:00:00,182.88,176
11057,11073,36491,Zsolt Low,1979-04-29 00:00:00,180.34,154
11058,11074,35506,Zurab Khizanishvili,1981-10-06 00:00:00,185.42,172
11059,11075,39902,Zvjezdan Misimovic,1982-06-05 00:00:00,180.34,176

In [28]:
# import data from player attribute table
q_player_attr = "SELECT * FROM Player_Attributes;"
df_player_attr = pd.read_sql_query(q_player_attr, conn)
df_player_attr = df_player_attr.loc[:, ['player_api_id', 'date', 'overall_rating']]

# df_player_attr.tail(100)

        player_api_id                 date  overall_rating
183878          99031  2015-09-25 00:00:00            80.0
183879          99031  2015-09-21 00:00:00            80.0
183880          99031  2015-04-10 00:00:00            78.0
183881          99031  2014-09-18 00:00:00            78.0
183882          99031  2014-05-09 00:00:00            76.0
...               ...                  ...             ...
183973          39902  2009-08-30 00:00:00            83.0
183974          39902  2009-02-22 00:00:00            78.0
183975          39902  2008-08-30 00:00:00            77.0
183976          39902  2007-08-30 00:00:00            78.0
183977          39902  2007-02-22 00:00:00            80.0

[100 rows x 3 columns]

In [29]:
# import team name
q_team = "SELECT * FROM Team"
df_team = pd.read_sql_query(q_team, conn)
df_team = df_team.loc[:, ['team_api_id', 'team_long_name', 'team_short_name']]

df_team.tail(10)

     team_api_id      team_long_name team_short_name
289        10179             FC Sion             SIO
290        10199           FC Luzern             LUZ
291         9824            FC Vaduz             VAD
292         7955     Neuchâtel Xamax             XAM
293        10243           FC Zürich             ZUR
294        10190       FC St. Gallen             GAL
295        10191             FC Thun             THU
296         9777         Servette FC             SER
297         7730  FC Lausanne-Sports             LAU
298         7896              Lugano             LUG

In [30]:
# import Country but wont use them they dont add value to the model
q_country = "SELECT * FROM Country"
df_country = pd.read_sql_query(q_country, conn)
df_country.tail()

       id         name
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

In [31]:
# import League but wont use them they dont add value to the model
q_league = "SELECT * FROM League"
df_league = pd.read_sql_query(q_league, conn)
df_league.tail()

       id  country_id                      name
6   15722       15722        Poland Ekstraklasa
7   17642       17642  Portugal Liga ZON Sagres
8   19694       19694   Scotland Premier League
9   21518       21518           Spain LIGA BBVA
10  24558       24558  Switzerland Super League

In [32]:
# import Team_Attributes but wont use them they dont add value to the model
q_team_attr = "SELECT * FROM Team_Attributes"
df_team_attr = pd.read_sql_query(q_team_attr, conn)
df_team_attr.tail()

,id,team_fifa_api_id,team_api_id,date,buildUpPlaySpeed,buildUpPlaySpeedClass,buildUpPlayDribbling,buildUpPlayDribblingClass,buildUpPlayPassing,buildUpPlayPassingClass,...,chanceCreationShooting,chanceCreationShootingClass,chanceCreationPositioningClass,defencePressure,defencePressureClass,defenceAggression,defenceAggressionClass,defenceTeamWidth,defenceTeamWidthClass,defenceDefenderLineClass
1453,1454,15005,10000,2011-02-22 00:00:00,52,Balanced,NaN,Little,52,Mixed,...,53,Normal,Organised,46,Medium,48,Press,53,Normal,Cover
1454,1455,15005,10000,2012-02-22 00:00:00,54,Balanced,NaN,Little,51,Mixed,...,50,Normal,Organised,44,Medium,55,Press,53,Normal,Cover
1455,1456,15005,10000,2013-09-20 00:00:00,54,Balanced,NaN,Little,51,Mixed,...,32,Little,Organised,44,Medium,58,Press,37,Normal,Cover
1456,1457,15005,10000,2014-09-19 00:00:00,54,Balanced,42.0,Normal,51,Mixed,...,32,Little,Organised,44,Medium,58,Press,37,Normal,Cover
1457,1458,15005,10000,2015-09-10 00:00:00,54,Balanced,42.0,Normal,51,Mixed,...,32,Little,Organised,44,Medium,58,Press,37,Normal,Cover

## Consolidating features from Matches, Players, and other dataframes into a single DF
This is the basis for model building

In [36]:
df_main = df_matches
df_main.tail()

,id,season,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal,home_player_1,home_player_2,...,away_player_2,away_player_3,away_player_4,away_player_5,away_player_6,away_player_7,away_player_8,away_player_9,away_player_10,away_player_11
25974,25975,2015/2016,2015-09-22 00:00:00,1992091,10190,10191,1,0,42231.0,678384.0,...,563066.0,8800.0,67304.0,158253.0,133126.0,186524.0,93223.0,121115.0,232110.0,289732.0
25975,25976,2015/2016,2015-09-23 00:00:00,1992092,9824,10199,1,2,33272.0,41621.0,...,114792.0,150007.0,178119.0,27232.0,570830.0,260708.0,201704.0,36382.0,34082.0,95257.0
25976,25977,2015/2016,2015-09-23 00:00:00,1992093,9956,10179,2,0,157856.0,274779.0,...,67349.0,202663.0,32597.0,114794.0,188114.0,25840.0,482200.0,95230.0,451335.0,275122.0
25977,25978,2015/2016,2015-09-22 00:00:00,1992094,7896,10243,0,0,NaN,8881.0,...,121080.0,197757.0,260964.0,231614.0,113235.0,41116.0,462608.0,42262.0,92252.0,194532.0
25978,25979,2015/2016,2015-09-23 00:00:00,1992095,10192,9931,4,3,274787.0,492132.0,...,95216.0,172768.0,22834.0,458806.0,207234.0,25772.0,40274.0,34035.0,41726.0,527103.0

In [41]:
# # 
# Left_join = pd.merge(df_main, 
#                      df_player_attr, 
#                      left_on ='home_player_1',
#                      right_on = 'player_api_id',
#                      how ='left')
# Left_join.tail()

In [43]:
# # export to csv
# df_main.to_csv("data/df_main.csv", sep='\t', encoding='utf-8')
# df_player.to_csv("data/df_player.csv", sep='\t', encoding='utf-8')

In [50]:

# iterations = 0

# now = datetime.now()
# print(now)
# newList = []
# for i in range(100000):
#     for j in range(1000):
#         newList.append(i*j)
# df_dummy = pd.DataFrame(newList)
# then = datetime.now();
# print(then)

2023-02-17 11:49:26.588226
2023-02-17 11:50:09.586583

In [ ]:
# always run this at connecting
conn.close()